---
kind: method
id: M:Autodesk.Revit.UI.IFCExternalServiceUIData.GetParentHwnd
source: html/a237122d-90c6-7c31-eaa0-a2d34a2e1375.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData.GetParentHwnd Method

return the parent handle

## Syntax (C#)
```csharp
public IntPtr GetParentHwnd()
```